Repository: Zigotote/barbu_score
Catalog: lib/commons/l10n/app_*.arb
Languages: fr

source: About
fr: A propos

# aboutLea
source: Léa LOUESDON, creator of graphic elements
fr: Léa LOUESDON, créatrice des éléments graphiques

# aboutOceane
source: Océane GILLARD, responsible for application development
fr: Océane GILLARD, chargée du développement de l'application

# aboutTheApp
source: The Score Barbu app is developed by enthusiasts who are committed to meeting the needs of Barbu players as best they can!
fr: L'application Score Barbu est développée par des passionnées qui ont à coeur de répondre au mieux aux besoins des joueurs de Barbu !

# aboutTheTeam
source: The team consists of:
fr: L'équipe est composée de :

# accept
source: Yes
fr: Oui

source: ace
fr: as

source: Activate contract
fr: Activer le contrat

# addCard
source: Add a card
fr: Ajouter une carte

# addItem
source: Add one {item}
fr: Ajouter {item, select, dame{une} other{un}} {item}

# alertCannotActivateSalad
source: Cannot activate
fr: Activation impossible

# alertCannotActivateSaladDetails
source: The salad must have at least one contract to be played to be activated.
fr: La salade doit posséder au moins un contrat à jouer pour être activée.

# alertContractPlayed
source: The contract has already been played
fr: Le contrat a déjà été joué

# alertContractPlayedBy
source: The contract has already been played by {players}. If it is deactivated, it will be removed from the game and {nbPlayers, plural, =1{this player will} other{these players will}} have to choose an additional contract at the end of the game.
fr: Le contrat a déjà été joué par {players}. S'il est désactivé il sera supprimé de la partie et {nbPlayers, plural, =1{ce joueur devra} other{ces joueurs devront}} choisir un contrat supplémentaire en fin de partie.

# alertExistingGame
source: A saved game exists
fr: Une partie sauvegardée existe

# alertSaladContractPlayedBy
source: The contract has already been played by {players}. Any changes in the settings of this contract will affect the saved contracts.
fr: Le contrat a déjà été joué par {players}. Toute modification dans les paramètres de ce contrat aura des répercussions sur les contrats sauvegardés.

source: and
fr: et

# appName
source: The Barbu
fr: Le Barbu

source: App theme
fr: Thème de l'application

# appTitle
source: Barbu Score
fr: Score Barbu

# askForFeedback
source: Have you detected a problem or have a suggestion for improvement? You can report it to us by email:
fr: Vous avez détecté un problème ou avez une suggestion d'amélioration ? Vous pouvez nous le signaler par mail :

source: Available color
fr: Couleur disponible

source: Back
fr: Retour

source: Best friend
fr: Meilleur ami

# bug
source: A bug
fr: Un bug

# cardInterval
source: {firstCard} to {lastCard}
fr: {firstCard} à {lastCard}

# cardsOrder
source: Aces are the highest cards. Before playing, the strongest cards must be kept until the required number is reached.
fr: Les as sont les cartes les plus fortes.

# cardsToKeep
source: Keep the cards
fr: Conserver les cartes

# cardsToKeepForPlayers
source: Before playing, keep the highest cards from {nbDecks, plural, =1{one deck} other{{nbDecks} decks}} of {nbCardsInDeck} cards until you have the required number. With {nbPlayers} players, you should therefore only keep the following cards: {cards}
fr: Avant de jouer il faut conserver les cartes les plus élevées {nbDecks, plural, =1{d'un paquet} other{de {nbDecks} paquets}} de {nbCardsInDeck} cartes jusqu'à obtenir le nombre requis. A {nbPlayers} joueurs, il faut donc conserver uniquement les cartes : {cards}

# cardToKeepPartially
source: {card}{nbCards, select, 1{♥} 2{♥♦} 3{♥♦♣} 4{♥♦} 5{♥♦ and a ♣} 6{♥♦♣} 7{♥♦♣ and a ♠} other{}}
fr: {card}{nbCards, select, 1{♣} 2{♣♠} 3{♣♦♠} 4{♣♠} 5{♣♠ et un ♦} 6{♣♦♠} 7{♣♦♠ et un ♥} other{}}

source: Changes saved
fr: Modifications sauvegardées

# changesSavedDetails
source: The changes have been saved and are effective immediately.
fr: Les changements ont été sauvegardés et sont effectifs dès maintenant.

source: Close
fr: Fermer

source: Color
fr: Couleur

# confirmStartGame
source: Confirm creation of a new game? If yes, the previous game with {players} will be lost.
fr: Confirmer la création d'une nouvelle partie ? Si oui, la partie précédente avec {players} sera perdue.

source: Contact by mail
fr: Contacter par mail

# contactReason
source: What would you like to report?
fr: Que souhaitez-vous signaler ?

source: Contract points
fr: Points du contrat

source: Contracts
fr: Contrats

# contractsOf
source: {player}'s contracts
fr: Contrats de {player}

# contractsRules
source: The Barbu game includes the following contracts:
fr: Le jeu du Barbu comporte les contrats suivants :

# contractRulesTitle
source: {contract} rules
fr: Règles {contract}

source: Contracts to play
fr: Contrats à jouer

source: Create players
fr: Créer les joueurs

source: Deactivate
fr: Désactiver

# deactivatedForGame
source: Disabled for your games.
fr: Désactivé pour vos parties.

# decksOfCards
source: {nbDecks, plural, =1{1 deck} other{{nbDecks} decks}} of {nbCards} cards.
fr: {nbDecks, plural, =1{1 paquet} other{{nbDecks} paquets}} de {nbCards} cartes.

# deckQuestion
source: Deck type
fr: Type de paquet

# defaultNbTricks
source: 8 tricks
fr: 8 plis

source: Delete
fr: Supprimer

source: Delete player
fr: Supprimer le joueur

source: Domino
fr: Réussite

# dominoScoreSubtitle
source: Who finished {rank}?
fr: Qui a fini {rank} ?

# endGame
source: End of game
fr: Fin de partie

source: English
fr: Anglais

# errorDomino
source: Not all players have been ranked.
fr: Tous les joueurs n'ont pas été classés.

# errorLaunchGame
source: Cannot start the game
fr: Impossible de lancer une partie

# errorLaunchGameDetails
source: All contracts are deactivated in the settings. At least one contract must be activated to play.
fr: Tous les contrats sont désactivés dans les paramètres. Il faut au moins un contrat activé pour pouvoir jouer.

# feature
source: A feature
fr: Une suggestion

# fold
source: Collapse the choices
fr: Replier les choix

# forGameAt
source: For a game of
fr: Pour une partie à

source: French
fr: Français

# fromTheDeck
source: {nbDecks, plural, =1{from the deck} other{from {nbDecks} decks}}.
fr: {nbDecks, plural, =1{du paquet} other{de {nbDecks} paquets}}.

source: Game
fr: Partie

source: Game principle
fr: Principe du jeu

# gamePrincipleDetails
source: This trick-taking game consists of different contracts that must be completed by all players. Each contract has specific rules that will be applied during the round of play. The game ends when all players have completed all the contracts.
fr: Ce jeu de plis est composé de (TODO Océane paramétrer ça) 7 contrats devant être réalisés par tous les joueurs. Chaque contrat possède des règles particulières, qui seront appliquées durant la manche de jeu. La partie se termine lorsque tous les joueurs ont réalisé l'ensemble des contrats.

# gameRound
source: Round of play
fr: Manche de jeu

# gameRoundRules
source: Distribute the same number of cards among the players.*The first player chooses the contract he wishes to play and announces it to the other players.*He starts the trick by playing a card, which determines the suit of the trick.*Each player plays a card in clockwise order.*If a player does not have a card of the required suit, they can play any card from their hand. The value of this card will be considered as null.*At the end of the round, the player who played the highest-value card wins the trick. He will start the next trick.*The round ends when all players have played all their cards.*Points are then counted according to the contract chosen by the first player.*The player to the left of the previous first player starts the next round.
fr: Distribuer le même nombre de cartes entre les joueurs.*Le premier joueur choisit le contrat qu'il souhaite jouer et l'annonce aux autres joueurs.*Il démarre le pli en posant une carte, qui détermine la couleur du pli.*Chaque joueur pose une carte dans le sens des aiguilles d'une montre.*Si un joueur ne possède pas de carte de la couleur demandée, il peut poser n'importe quelle carte de son paquet. La valeur de cette carte sera alors considérée comme nulle.*A la fin du tour, le joueur ayant posé la carte de la plus grande valeur emporte le pli. C'est lui qui démarrera le pli suivant.*La manche s'arrête lorsque les joueurs ont joué toutes leurs cartes.*Les points sont ensuite comptés selon le contrat choisi par le premier joueur.*Le joueur à la gauche du premier joueur précédent démarre la manche suivante.

source: Game saved
fr: Partie sauvegardée

# go
source: Let's go!
fr: C'est parti !

# goHome
source: Go back to home
fr: Retour à l'accueil

source: heart
fr: coeur

# hintDarkMode
source: dark mode
fr: mode sombre

# hintLightMode
source: light mode
fr: mode clair

# hintForDarkMode
source: set dark mode
fr: passer en mode sombre

# hintForLightMode
source: set light mode
fr: passer en mode clair

source: Invert score
fr: Inversion du score

# invertScoreNegativeDetails
source: If a player wins all, their score becomes negative.
fr: Si un joueur remporte tout, son score devient négatif.

# invertScorePositiveDetails
source: If a player wins all, their score becomes positive.
fr: Si un joueur remporte tout, son score devient positif.

source: jack
fr: valet

source: Keep
fr: Conserver

source: king
fr: roi

source: Language
fr: Langue

# loadGame
source: Load a game
fr: Charger une partie

# loadGameIndication
source: Select "Load a game" to continue.
fr: Sélectionnez "Charger une partie" pour la poursuivre.

# loadPreviousGame
source: Resume the previous game with {players}?
fr: Reprendre la partie précédente avec {players} ?

source: Lowest
fr: Plus faibles

# maxScore
source: Highest score
fr: Score élevé

# minScore
source: Lowest score
fr: Score faible

source: Mix
fr: Mélanger

# modify
source: Modify {contract}
fr: Modification {contract}

# modifyContractsSettings
source: The contracts can be modified on the settings page to customize their points and variations.
fr: Les contrats sont modifiables dans la page de paramètres, pour personnaliser leurs points et variations.

source: Modify player
fr: Modifier le joueur

source: Modify settings
fr: Modifier les paramètres

# moreInfo
source: More information
fr: Plus d'informations

# nbCards
source: {nbCards} cards
fr: {nbCards} cartes

# nbCardsRules
source: The game is played with {nbCards} cards ({nbTricks} cards by player).
fr: Le jeu se joue avec {nbCards} cartes ({nbTricks} cartes par joueur).

# nbDecksRules
source: The game is played with {nbDecks, plural, =1{1 deck} other{{nbDecks} decks}} of {nbCardsByDeck} cards.
fr: Le jeu se joue avec {nbDecks, plural, =1{1 paquet} other{{nbDecks} paquets}} de {nbCardsByDeck} cartes.

# nbItemsByPlayer
source: Number of {item}s per player
fr: Nombre de {item}s par joueur

# nbTricksTooltip
source: An optimized number of tricks means distributing all the cards in the deck evenly among the players.
fr: Un nombre de plis optimisé revient à distribuer équitablement toutes les cartes du jeu entre les joueurs.

# nbTricksQuestion
source: Number of tricks
fr: Nombre de plis

source: Next
fr: Suivant

source: No game found
fr: Aucune partie trouvée

# noGameFoundDetails
source: The previous game was not found. Starting a new game.
fr: La partie précédente n'a pas été retrouvée. Lancement d'une nouvelle partie.

source: No hearts
fr: Sans coeurs

source: No last trick
fr: Dernier

source: No queens
fr: Sans dames

source: No tricks
fr: Sans plis

source: Optimized
fr: Optimisé

source: Other
fr: Autre

# playerNameHint
source: Name of player {nb}
fr: Nom du joueur {nb}

# playerTurn
source: Turn of
fr: Tour de

source: player
fr: joueur

source: players
fr: joueurs

source: Player's order
fr: Ordre des joueurs

# pointsBy
source: Points by {item}
fr: Points par {item}

source: Points for {nb} players
fr: Points à {nb} joueurs

# prepareGame
source: Prepare the game
fr: Préparer la partie

# prepareGameRules
source: Game setup
fr: Préparation du jeu

# presentGame
source: Barbu is a card game for 3 to 10 players.
fr: Le barbu est un jeu de cartes pour 3 à 10 joueurs.

# presentGameGoalMaxScore
source: The goal is to score as many points as possible.
fr: L'objectif est de marquer le plus de points possible.

# presentGameGoalMinScore
source: The goal is to score as few points as possible.
fr: L'objectif est de marquer le moins de points possible.

source: Previous
fr: Précédent

source: queen
fr: dame

# randoms
source: Random
fr: Aléatoires

source: Ranking
fr: Classement

source: Rate app
fr: Evaluer l'application

# refuseLoadGame
source: No, new game
fr: Non, nouvelle partie

# refuseStartGame
source: No, resume game
fr: Non, reprendre la partie

# reportBug
source: Report a bug
fr: Signaler un bug

# reportBugMail
source: Hello, I’d like to report a bug I encountered in the application. Please find the details below: - Bug description (describe what happened, what you were doing when the issue occurred, etc.): - Steps to reproduce (list the steps needed to make the issue happen again): - Expected behavior (describe what should have happened instead)
fr: Bonjour, Je souhaiterai signaler un bug rencontré sur l’application. Voici les détails : - Description du bug (expliquez ce qu'il s’est passé, ce que vous faisiez avant que le problème apparaisse, etc.) : - Étapes pour reproduire le bug (indiquez les actions à suivre pour que le problème se reproduise) : - Comportement attendu (ce qui aurait dû se passer) :

# requestFeature
source: Request a feature
fr: Ajouter une amélioration

# requestFeatureMail
source: Hello, I’d like to suggest a new feature for the application to be able to...
fr: Bonjour, Je souhaiterai proposer une nouvelle fonctionnalité pour l'application, afin de...

# rules
source: Game rules
fr: Règles du jeu

# rulesBarbu
source: The player who wins the king of hearts (Barbu) scores {points} points.
fr: Le joueur emportant le roi de coeur (Barbu) marque {points} points.

# rulesBarbuInSalad
source: - the king of hearts (Barbu) is worth {points} points
fr: - le roi de coeur (Barbu) vaut {points} points

# rulesDomino
source: Unlike other contracts, Domino is not a trick-taking contract. The goal of this contract is to lay all the cards on the table, sorted by suit and in ascending order. The player who chooses this contract determines the starting value of the sequence (for example, the jack). If they have a card of that value, they place it on the table; otherwise, they skip their turn. The next player can then play a card of the same suit and of a value directly higher or lower (so the 10 or the queen of the same suit). They can also play another card of the starting value in a different suit. If they play an ace, they may play again. If they cannot play a card, they pass. The game continues in this manner until all players have finished their hands. The objective is to play all your cards as quickly as possible.
fr: Contrairement aux autres contrats, la réussite n'est pas un contrat à plis. L'objectif de ce contrat est de poser toutes les cartes du jeu sur la table, triées par couleur et dans l'ordre croissant. Le joueur choisissant ce contrat détermine la valeur d'ouverture de la réussite (par exemple le valet). S'il possède une carte de cette valeur, il la pose sur la table, sinon il passe son tour. Le joueur suivant peut ensuite poser une carte de même couleur et de valeur directement supérieure ou inférieure (donc le 10 ou la dame de la couleur précédente). Il peut aussi poser une carte de la valeur d'ouverture, dans une autre couleur. S'il joue un as, il peut rejouer. S'il ne peut pas poser de carte, il indique qu'il passe. Le jeu se poursuit ainsi jusqu'à ce que tous les joueurs aient fini leur paquet. L'objectif est de poser toutes ses cartes le plus rapidement possible.

# rulesDominoDetailed
source: The goal of Domino is to lay all the cards on the table, sorted by suit and in ascending order. {player} determines the starting value of the sequence (for example, the jack), and plays a card of that value if they have one. The next player then plays a card of the same suit and of a value directly higher or lower (so the 10 or the queen of the same suit), or a card of the starting value in a different suit. If they play an ace, they may play again. If they cannot play a card, they pass. The game continues in this manner until all players have finished their hands. Points are awarded based on the order in which players finish, distributed as follows: {points}
fr: L'objectif de la réussite est de poser toutes les cartes du jeu sur la table, triées par couleur et dans l'ordre croissant. {player} détermine la valeur d'ouverture de la réussite (par exemple le valet), et pose une carte de cette valeur s'il y en a dans son jeu. Le joueur suivant pose ensuite une carte de même couleur et de valeur directement supérieure ou inférieure (donc le 10 ou la dame de la couleur précédente), ou une carte de la valeur d'ouverture. S'il joue un as, il peut rejouer. S'il ne peut pas poser de carte, il indique qu'il passe. Le jeu se poursuit ainsi jusqu'à ce que tous les joueurs aient fini leur paquet. Les points marqués dépendent de l'ordre de fin des joueurs, et sont distribués comme suit : {points}

# rulesNoHearts
source: Each player scores {points} points per heart won.
fr: Chaque joueur marque {points} points par coeur remporté.

# rulesNoHeartsInSalad
source: - each heart is worth {points} points
fr: - chaque coeur vaut {points} points

# rulesNoQueens
source: Each player scores {points} points per queen won.
fr: Chaque joueur marque {points} points par dame remportée.

# rulesNoQueensInSalad
source: - each queen is worth {points} points
fr: - chaque dame vaut {points} points

# rulesNoLastTrick
source: The player who wins the last trick scores {points} points.
fr: Le joueur emportant le dernier pli marque {points} points.

# rulesNoLastTrickInSalad
source: - the last trick is worth {points} points
fr: - le dernier pli vaut {points} points

# rulesNoTricks
source: Each player scores {points} points per trick won.
fr: Chaque joueur marque {points} points par pli remporté.

# rulesNoTricksInSalad
source: - each trick is worth {points} points
fr: - chaque pli vaut {points} points

# rulesSalad
source: This contract is a combination of the {contracts} contracts. It is the contract that can score the most points since the points of each contract are added together.
fr: Ce contrat est une combinaison des contrats {contracts}. C'est le contrat qui peut faire marquer le plus de points puisque les points de chaque contrat s'additionnent.

# rulesSaladDetailed
source: This contract is a combination of the contracts {contracts}. Points are counted as follows: {itemWithPoints}
fr: Ce contrat est une combinaison des contrats {contracts}. Les points sont comptés comme suit : {itemWithPoints}

# rulesTrickRound
source: {player} starts the first trick, and thereby determines the leading suit. The player who played the highest card of that suit wins the trick and starts the next one.
fr: {player} démarre le premier pli, et détermine ainsi sa couleur. Le joueur ayant posé la carte de cette couleur la plus élevée remporte le pli. Il démarre le pli suivant.

source: Salad
fr: Salade

# saladScoresSubtitle
source: What is the score of each contract?
fr: Quel est le score de chaque contrat ?

source: Save and leave
fr: Sauvegarder et quitter

source: Scores by contract
fr: Scores par contrat

# scoresNotValid
source: Invalid scores
fr: Scores incorrects

# seePreviousGame
source: See the previous game with {players}?
fr: Revoir la partie précédente avec {players} ?

source: Settings
fr: Paramètres

# startGame
source: Start a game
fr: Démarrer une partie

# table
source: The table
fr: La table

source: trick
fr: pli

# unfold
source: Expand the choices
fr: Déplier les choix

source: Validate
fr: Valider

source: Validate scores
fr: Valider les scores

# whoWonItem
source: Who won the {item}?
fr: Qui a remporté le {item} ?

source: Worst ennemy
fr: Pire ennemi
